package Homework.Number2.Part1;

/*
На вход подается строка S, состоящая только из русских заглавных букв (без Ё).

Необходимо реализовать метод, который кодирует переданную строку с помощью азбуки Морзе и затем вывести результат на экран. Отделять коды букв нужно пробелом.

Для удобства представлен массив с кодами Морзе ниже:
{".-", "-...", ".--", "--.", "-..", ".", "...-", "--..", "..", ".---", "-.-", ".-..", "--", "-.", "---", ".--.", ".-.", "...", "-", "..-", "..-.", "....", "-.-.", "---.", "----", "--.-", "--.--", "-.--", "-..-", "..-..", "..--", ".-.-"}

Алгоритм решения:
1. Создать массив с кодами Морзе и заполнить его шаблоном
2. Получить на вход строку и разобрать ее на символы через цикл
3. Для каждого символа вывести соответствие из массива Морзе и отделить пробелом
 */

import java.util.Arrays;
import java.util.Scanner;

public class N2Part1Number6 {
    static final String[] arrayMorze = {".-", "-...", ".--", "--.", "-..", ".", "...-", "--..", "..", ".---", "-.-", ".-..", "--", "-.", "---", ".--.", ".-.", "...", "-", "..-", "..-.", "....", "-.-.", "---.", "----", "--.-", "--.--", "-.--", "-..-", "..-..", "..--", ".-.-"};
    static final char[] arrayAlphabet = {'А','Б','В','Г','Д','Е', 'Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я'};

    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);

        String WORD = sc.nextLine();

        letterToMorse(WORD);
    }
    public static void  letterToMorse(String s) {
        char[] chars = s.toCharArray();
        String str = "";
        for (int i = 0; i < chars.length; i++){
            for (int j = 0; j < arrayAlphabet.length; j++){
                if (arrayAlphabet[j] == chars[i]){
                    str = str + arrayMorze[j] + " ";
                }
            }
        }
        System.out.println(str);
    }

}

