package Day_3;

/*


Напишите логическое выражение, которое равно true, если число, сохраненное в переменной num,
находится в диапазоне от 1 до 100 не включительно.

boolean isTrue = (num > 1) && (num < 100);

Напишите логическое выражение, которое равно true, если число, сохраненное в переменной num,
находится в диапазоне от 1 до 100 не включительно или если число является отрицательным.

boolean isTrue = (num > 1) && (num < 100) || num < 0;




Напишите логические выражения, которые равны true при:

    age больше 13 и меньше 18;
    weight больше 23 кг или height больше 152 см;
    weight больше 23 кг и height больше 152 см;
    weight больше 23 кг или height больше 152 см, но не одновременно.

1. (age > 13) && (age < 18)
2. (weight > 23) || (height > 152)
3. (weight > 23) && (height > 152)
4. (weight > 23) ^ (height  > 152)



 */

public class LogicOperators {
    public static void main(String[] args) {

    }
}
