package Day_1;

/*
Задание

Вычислите результат для следующих операций остатка от деления:

56 % 6
78 % -4
-34 % 5
-34 % -5
5 % 1
1 % 5
 */

public class Vichislenia {
    public static void main(String[] args) {
        System.out.println(56 % 6 + ", " + 78 % -4 + ", " + -34 % 5 + ", " + -34 % -5 + ", " + 5 % 1 + ", " + 1 % 5);
    }
}
